{
  "kind": "build_request",
  "title": "Horsepower Calculator (Weight + Trap Speed)",
  "projectName": "Trap HP",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single-page horsepower calculator that computes estimated horsepower from vehicle weight and quarter-mile trap speed, using a clearly displayed formula and units.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "Page includes inputs for vehicle weight and trap speed and a button to calculate.",
        "The result is shown as estimated horsepower with sensible rounding (e.g., whole HP).",
        "The UI clearly labels units (default: pounds (lb) and miles per hour (mph)) and displays the formula used (e.g., HP = weight * (trapSpeed/234)^3)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add input validation and user guidance for the calculator fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "Weight and trap speed fields reject empty, non-numeric, zero, and negative values with inline error messages.",
        "Trap speed input is constrained to a reasonable range (e.g., 1–400 mph) and weight to a reasonable range (e.g., 1–20,000 lb), with errors if out of range.",
        "Calculate button is disabled (or no-op with errors) until inputs are valid."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the horsepower calculation in the Motoko backend as a query method and have the frontend call it to compute the result.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that accepts weight and trap speed (as numbers) and returns the computed horsepower as a number.",
        "Frontend uses the generated canister actor to call the backend method when the user calculates.",
        "Frontend displays a clear error state if the backend call fails."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a lightweight results panel that explains the output and includes a reset action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "After calculation, a results card shows estimated horsepower prominently and repeats the input values used.",
        "A short disclaimer is shown (e.g., 'Estimated horsepower based on trap speed; real-world results vary').",
        "A Reset/Clear button returns the form to its initial state."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a coherent visual theme suitable for a motorsport/drag-racing calculator and enforce it consistently across layout, typography, and components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "Use a distinct, consistent theme (e.g., dark 'asphalt' background, high-contrast typography, accent color such as safety orange or lime) without using a blue/purple primary palette.",
        "The page has a clean centered layout that works on mobile and desktop.",
        "Form controls and result card follow the same design system (spacing, borders, focus states)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add generated static images for branding/background and render them in the UI from frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create an app for calculating horsepower based on weight and trap speed"
        ]
      },
      "acceptanceCriteria": [
        "Generated images are committed under frontend/public/assets/generated and referenced directly by the frontend (no backend image serving).",
        "The app displays the logo/icon in the header and uses the background image subtly (with readable contrast)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Backend must remain a single Motoko actor; do not introduce additional backend services.",
    "Do not modify files under frontend/src/components/ui or other immutable paths; compose them instead."
  ],
  "nonGoals": [
    "User accounts or Internet Identity authentication.",
    "Persisting calculation history on-chain.",
    "Supporting multiple racing distance calculators (eighth-mile, dyno curves, etc.) beyond weight + trap speed."
  ],
  "imageRequirements": {
    "required": [
      "Minimal drag-racing themed app logo/icon, flat vector style, transparent background (trap-hp-logo.dim_512x512.png)",
      "Subtle dark asphalt/drag-strip background texture, wide, low-contrast (dragstrip-bg.dim_1920x1080.png)"
    ],
    "edits": []
  }
}